{
    "Azawakh": "The short, smooth Azawakh coat comes in a variety of colors, including clear sand to dark red, white, black, blue, gray, brindle, grizzle, parti-color and all shades of brown, including chocolate. The stomach may be hairless.",
    "Fox Terrier": "Smooth Fox Terriers have smooth, hard, dense coats that shed very little. The coat of the Wire Fox Terrier is also dense but wiry, reminiscent of the matting on a coconut — the ideal look is for the hairs to twist, making them look broken. The coat can be crinkly or have a slight wave.",
    "Norwegian Buhund": "The Norwegian Buhund has a soft, dense undercoat topped by a thick, hard outer coat. It comes in wheaten — pale cream to bright orange, with or without dark-tipped hairs and as little white as possible — or black, with as little white as possible. The coat on the head and front of the legs is shorter than on the rest of the body.",
    "Clumber Spaniel": "The Clumber Spaniel has a soft, medium-length coat that's thick and straight, lying flat on the body. The ears, legs, and belly have moderate feathering — a longer fringe of hair — and there's a frill below the neck, longer hair that's sometimes referred to as an apron. Clumbers are easy to prepare for the show ring because they're supposed to look natural, with no shaving or trimming except to tidy the feet, rear legs, and tail.",
    "Rottweiler": "Rottweilers have a short double coat that's straight and coarse. The outer coat is medium in length, shorter on the head, ears, and legs; the undercoat is found mainly on the neck and thighs. The amount of undercoat your Rottie has depends on the climate in which he lives.",
    "Basenji": "The Basenji wears a short, fine coat of rich chestnut red, black, tricolor (black and chestnut), or brindle (black stripes on a chestnut background), all with white feet, chest, and tail tip. He may also have white on his legs, a white blaze running up the center of his face between his eyes, or a white collar — a white marking around his neck. You'll always see more of his primary color than white. His markings stand out clearly and never look muddy.",
    "Goldendoodle": "The Goldendoodle should have a wavy to curly coat of about two to three inches in length. He has longer hair on the tail, body, ears, and legs (legs may be slightly feathered); the hair on the head and muzzle tends to be shorter.",
    "Leonberger": "The Leonberger's long, water-resistant double coat is straight and moderately soft. It comes in lion-yellow, golden to reddish-brown, with a black mask.",
    "English Toy Spaniel": "The English Toy Spaniel has an abundant coat that is long and straight to slightly wavy with a silky texture. Feathering should appear on all four legs and feet. Fringing should appear on the body, chest and ears.",
    "Canaan Dog": "Canaan Dogs have a double coat that insulates them from desert temperature extremes. The outer coat is straight and harsh to the touch, lying flat on the body, with a slight ruff on the neck. The undercoat is short and soft. The thickness of the undercoat varies depending on the climate in which the dog lives. The bushy tail tapers to a pointed tip.",
    "Siberian Husky": "",
    "Brussels Griffon": "Rough-coated Brussels Griffons have a wiry, dense coat with no silky hair anywhere on their bodies. The hair on the head is slightly longer around the eyes, cheeks, and chin. Although it's wiry, the rough coat should never appear untidy.",
    "Schipperke": "At times it seems as if a mad fashion designer created the Schipperke. He has a distinctive coat with a unique silhouette, giving the appearance of a slope that runs from the shoulders to the croup (the end of the back).",
    "Lowchen": "The Lowchen has a dense coat that is long and moderately wavy with a soft texture. Lowchens can be found in all colors and combinations, and there is no preference for any one color or combination.",
    "Norwegian Lundehund": "A dense, rough outer coat is insulated by a soft undercoat in reddish-brown to fawn with black hair tips; black or gray with white markings; or white with dark markings. Norwegian Lundehunds shed heavily and need regular brushing with a firm bristle brush.",
    "Cesky Terrier": "Cesky Terriers have a soft bluish-gray coat that ranges from silver to dark charcoal. Puppies are all black, and the coat lightens over the first few years of life. Unlike many terriers, he has the advantage of a soft coat that can be trimmed with clippers rather than requiring hand-stripping (plucking dead hairs by hand).",
    "Cane Corso": "The Corso has a short, stiff coat with a light undercoat. It can be black, gray, red or fawn and may or may not have a brindle pattern. The coat sheds heavily twice a year, so have a good vacuum cleaner on hand to suck up the dust bunnies.",
    "Cocker Spaniel": "There are few breeds as handsome as the well-groomed Cocker Spaniel. His thick, sometimes wavy coat is short on the head and back and long on the ears, chest, belly, and legs. The coat is a solid color (black or light cream to red to brown), or parti-color (two or more colors, one of which is white).",
    "Scottish Deerhound": "The thick coat of a Scottish Deerhound is 3 to 4 inches long, harsh and wiry, meant to protect the dog as he hunted the rough terrain of the Scottish Highlands. In contrast, the hair on the head, belly, and breast is usually quite soft. A slight fringe of hair — not enough to be called feathering — adorns the backs of the legs. Climate affects the texture of the coat, and in the United States Deerhounds commonly have a coat that is a mix of wiry and silky hair. No self-respecting Deerhound has a woolly coat, however, which doesn't shed dirt the way the wiry coat does.",
    "Barbet": "The Barbet's long, woolly coat is waterproof. It ranges from wavy to curly, and colors include solid black, gray, brown, fawn, pale fawn, red fawn, and white.",
    "American Pit Bull Terrier": "The short coat is shiny and stiff to the touch, and comes in all colors — red, blue, brown, grey, black and white, and brindle, among them.",
    "Skye Terrier": "The Skye wears an elegant and stylish coat that hangs straight down each side from a part that runs down the back from head to tail. The undercoat is short, soft, and woolly, covered with an outer coat of straight hair with a hard texture.",
    "Havanese": "The Havanese coat is thick but silky, soft, and light, and it doesn't shed easily. The coat is long and ranges from straight to curly, although wavy is considered the ideal for the show ring. It comes in white, black, black and tan, sable, gray, and a myriad of other colors and markings.",
    "Labradoodle": "Although a Labradoodle can have one of a range of coat types, the desired length is four to six inches. They have a single coat with hair ranging from straight to loose curls. The curls shouldn't be tight and the coat shouldn't be thick or fluffy.",
    "Lakeland Terrier": "Lakeland Terriers have a thick, hard topcoat and a soft undercoat. When he's hand stripped to show his outline, he has a neat, workmanlike appearance. In the show ring, the coat on the head, ears, forechest, shoulders, and behind the tail is trimmed short and smooth. The coat on the body is about half an inch to an inch long and can be straight or slightly wavy. The long hair on the legs, known as furnishings, gives the legs a cylindrical appearance. The hair on the face is trimmed but left longer over the eyes to enhance the head's rectangular appearance.",
    "Miniature Schnauzer": "Miniature Schnauzers are solid black, salt and pepper, black and silver, or white. A solid white Miniature Schnauzer can't be shown in American Kennel Club shows, however, so white ones are by definition pet quality instead (which makes no difference to the dog's temperament). Many Miniature Schnauzer fanciers dislike the white coat, feeling that if you want a white terrier you should get a West Highland White Terrier.",
    "Xoloitzcuintli": "The hairless Xolo has smooth but tough skin that fits closely to their body. What little hair they have adorns the top of the head, the feet and the last third of the tail, up to the tip. A coated Xolo is completely covered with short, smooth, close-fitting hair. In both varieties, the hair may be any color. Typically, it is black, gray-black, slate, red, liver or bronze. Some Xolos have white spots and markings.",
    "English Cocker Spaniel": "English Cocker Spaniels have medium-long coats that are flat or slightly wavy, with a silky texture. The legs, chest, and belly are covered with longer hair called feathering, but not as much as that of their cousin, the American Cocker Spaniel. Feathering is more than decorative; it helps to protect the dog's body from scratches or other injuries as he makes his way through the field.",
    "English Setter": "The English Setter's attractive coat is one of his charms. The coat lies flat without any curl or woolliness. It's embellished with feathering — a longer fringe of hair — on the ears, chest, belly, underside of the thighs, backs of the legs, and on the tail: just enough to be pretty but not so much that it would impede the Setter's progress in the field.",
    "Irish Setter": "His beautiful coat is one of the characteristics that give the Irish Setter his reputation as one of the most beautiful breeds in the dog world. Short and fine on the head and forelegs, the burnished mahogany or rich chestnut red coat is moderately long and straight on the rest of the body, with long, silky feathering on the ears, the backs of the forelegs and thighs, and the tail, and a fringe of hair on the belly and chest. In the show ring, Irish Setters are trimmed to emphasize the lean head and clean neck and to show the natural outline of the foot.Brush your Irish Setter at least every other day to keep his coat shiny and tangle-free. Check for burrs and other debris any time he's been out in the field or on a hike. Unless he rolls in something stinky, he shouldn't need a bath more than a couple of times a year, as long as you keep him well brushed. You can bathe him more frequently if you want, however, and you'll need to if you plan to show him. Use a shampoo made for dogs to avoid drying out his coat and skin.",
    "Australian Cattle Dog": "The Australian Cattle Dog's weather-resistant outer coat is short and straight; he has a dense undercoat. The typical Australian Cattle Dog doesn't shed year-round, but instead he \"blows\" his coat once or twice a year (think of a snowstorm). In just a few weeks, the undercoat sheds in clumps.",
    "Nova Scotia Duck Tolling Retriever": "The Toller has a medium-length, water-repellent double coat. The red or orange color gives him a foxlike appearance, even giving rise to the tale that he's the result of a fox-retriever cross, a genetic impossibility.",
    "Boykin Spaniel": "The medium-length outer coat is flat to slightly wavy and tops a short, dense undercoat that keeps the dog warm when retrieving from water. Light feathering covers the ears, chest, legs, and belly. In color, he's a rich, solid liver, brown, or dark chocolate.",
    "Brittany": "Brittanys aren't heavily coated dogs. They have dense, flat, or wavy hair that's never curly, wiry, or silky. You'll see a little feathering on the ears and legs, but not so much that the Brittany would have trouble making his way through dense brush and undergrowth. You might notice that your Brittany's skin is fairly loose. Loose skin sort of rolls when it comes in contact with burrs and thorns, protecting the dog from puncture wounds.",
    "Pharaoh Hound": "The Pharaoh Hound has a short coat with a fine to slightly harsh texture. His color ranges from a rich tan to a chestnut tan. He may have a dab of white on the tip of the tail, the toes, the chest, or on the center of the face.",
    "American English Coonhound": "The hard, medium-length coat can be several different color combinations: Red and white ticked, blue and white ticked, tricolor with ticking, red and white, or black and white.",
    "Swedish Vallhund": "The Vallhund is a double-coated Spitz breed with medium-length hair. The undercoat is soft and dense, protected by a harsh topcoat. A woolly, curly or fluffy coat is not correct for the show ring and can be more of a hassle to groom, but it doesn’t affect a Vallhund’s ability to be a great companion.",
    "Otterhound": "You might say the messy look is \"in\" with the Otterhound. This characteristically scruffy-looking breed has a double coat. The outer coat is two to six inches long, rough and very thick. The undercoat is woolly and slightly oily. With this combination, the Otterhound is relatively weather-resistant, and he can bound in and out of streams and lakes without the undercoat absorbing a great deal of water.",
    "Dandie Dinmont Terrier": "Dandie Dinmont Terriers have a crisp topcoat that covers a soft, downy, waterproof undercoat. The topcoat, which is about 2 inches long, gets its crisp texture from the mixture of two-thirds hard hair with one-third soft hair. The topknot is very soft silky hair.",
    "Saluki": "The Saluki has a short, smooth, silky body coat. The entire body can be smooth, or the Saluki can have slight feathering on the legs, the backs of the thighs and sometimes the shoulders, and the underside of the tail. The long ears are covered with silky hair.",
    "Standard Schnauzer": "The Standard Schnauzer's outer coat is wiry, hard, and dense, with hairs that stand up from the skin. Beneath is a soft undercoat. On the back, the coat can be from 3/4 to 2 inches long.",
    "Entlebucher Mountain Dog": "The Entle's coat is thick, dense, and tricolored. The coloring is mostly shiny black, with white on the chest, all four feet, and the tip of the tail, as well as a white blaze from the muzzle to the top of the head. Areas between the black and white are rust-colored. They have a thick undercoat and a top coat. Weekly brushing will help keep shedding to a minimum.",
    "Lancashire Heeler": "The Lancashire Heeler sports a coarse, shiny coat that can be black or liver-colored, both with tan markings. They have a fine undercoat below a thick, weather-resistant topcoat. The coat is slightly longer around the neck.",
    "Shih Tzu": "The long, silky Shih Tzu coat is gorgeous, and it comes in many colors: black, black and white, gray and white, or red and white. A white tip on the tail and a white blaze on the forehead are highly prized.",
    "Korean Jindo Dog": "The Jindo is recognized by the UKC in six different colors: white, fawn, red, brindle, grey, black, and black and tan.",
    "Greyhound": "Greyhounds have a short, smooth coat that's easy to care for. Despite their name, they can be any color, including fawn, black, red, blue, gray, or white. They can also be various shades of brindle, a striped pattern that gives them the look of having just streaked across the African savanna, or white with at least one other color, known as particolor.",
    "Norwich Terrier": "The Norwich Terrier wears a hard, wiry, straight topcoat over a soft, downy, insulating undercoat. The hair on his neck and shoulders forms a protective mane. Small dark eyes twinkle beneath slight eyebrows. The hair on the rest of his head, including the ears and muzzle, is short.",
    "Staffordshire Bull Terrier": "The Staffordshire Bull Terrier has a short, smooth coat that lies close to the skin. It comes in red, fawn, white, black, or blue, or any of these colors with white, as well as brindle or brindle with white.",
    "Mutt": "Mixed breeds come in all colors of the dog rainbow, and their grooming needs depend on what type of coat they have. Bathing should be done as needed for all breeds.",
    "Anatolian Shepherd Dog": "The Anatolian Shepherd Dog's coat is short (about an inch long) with a thick undercoat. Sometimes there is feathering on the ears, legs, and tail. Their coat comes in many colors, including pinto, white, and brindle, but fawn with a black mask is common.",
    "Airedale Terrier": "The handsome coat of the Airedale Terrier has two layers: a topcoat, which is dense and wiry, and an undercoat, which is short and soft. Most Airedales Terriers have a specific coat combination: the majority of the dog is tan (ears, legs, head, underbelly, and occasionally the shoulders) and the back and upper sides are either black or grizzled (black mixed with gray and white). Sometimes there is a speckling of red in the black and a small white star on the chest.",
    "Pekingese": "The Pekingese wears a coat that is long, coarse, and straight, standing away from the body like a furry halo. Beneath the topcoat is a thick, soft undercoat. True to his description as a lion dog, the Pekingese has a noticeable mane on the neck and shoulder area, with the coat on the rest of the body being somewhat shorter. While it should be long and profuse, the coat should not obscure the shape of the body. Long feathering is found on the backs of the legs and on the toes, with longer fringing on the ears and tail.",
    "Weimaraner": "The Weimaraner's coat is short, smooth, sleek, and solid-colored, ranging from mouse-gray to silver-gray, usually with lighter shades on the head and ears. A distinctly long coat is a disqualification according to the American Kennel Club breed standard — a written description of how a breed looks — but in European countries a longhaired variety is recognized. Longhaired Weimaraners have a silky coat and feathering on their tails and legs, but they are rarely seen in this country.",
    "Shetland Sheepdog": "Shelties have a double coat. The undercoat is short and dense, causing the longer, harsher topcoat to stand out from the body. The hair on the head, ears, and feet is smooth, but the mane and frill (the hair around the neck and on the forechest) are abundant. The legs and tail are furry as well.",
    "Samoyed": "The Samoyed has a straight outer coat and a soft, thick undercoat (often referred to as wool). It can be pure white, white and biscuit, cream, or biscuit — and sheds heavily.",
    "Greater Swiss Mountain Dog": "The Swissy has a dense outer coat, about one to two inches in length, and a thick undercoat. The breed sheds minimally most of the time, with the exception of twice-yearly \"blow-outs,\" when the undercoat comes out. The color is distinct, with a black outer coat and rust and white markings on the face and body.",
    "Poodle": "The Poodle is a non-shedding breed, and a good choice for people with allergies. Many allergic people are able to keep a Poodle with no reaction.",
    "Belgian Malinois": "Malinois have short, straight hair that feels hard to the touch. The hard topcoat and dense undercoat provide weather resistance for a dog who was bred to work outdoors in all conditions. The hair is slightly longer around the neck, forming a sort of mini-mane.",
    "Neapolitan Mastiff": "The Neo has a coat that comes in solid gray, black, mahogany, and tawny or in tan brindle, in which the dog appears dark with tan stripes. A Neo with a white spot on the head is disqualified from the show ring, but it doesn't affect their ability to be a companion or guardian.",
    "Soft Coated Wheaten Terrier": "The Soft Coated Wheaten Terrier's silky single coat makes him stand out from the rest of the terrier family. The abundant coat covers the entire body in gentle waves, with a fall of hair over the eyes.",
    "Puli": "The Puli coat is considered to be nonshedding and hypoallergenic. Most Pulik are black, though white and gray are also found in the United States. In Hungary, the most common color after black is the brownish fako (described as the color of a whole-wheat roll).",
    "Great Pyrenees": "Great Pyrenees are considered to be average to heavy shedders, depending on the climate they live in, so expect to have white hairs on your clothes, furniture, car, and toothbrush.",
    "Treeing Tennessee Brindle": "The short, smooth coat comes in brindle or black with brindle trim. Some dogs have white markings on the breast or feet.",
    "Boston Terrier": "Perennially on the best-dressed list, the Boston Terrier wears a smooth, fine coat that comes in three colors: black, seal (looks black but has a reddish cast when seen in sunlight), or brindle, all with a white muzzle, face blaze, and chest, giving him the look of wearing a tuxedo.",
    "Pyrenean Shepherd": "The Pyrenean Shepherd comes in two varieties, rough-faced and smooth-faced. Both varieties can be born in the same litter. Rough-faced Pyr Sheps have long or medium-length hair that's flat or slightly wavy, with a harsh texture. The hair on the end of the muzzle and chin is naturally short, with longer, swept-back hair on the sides of the muzzle and cheeks, giving the dog a windblown look.",
    "Pug": "Even though the coats are short, Pugs are a double-coated breed. Pugs are typically fawn-colored or black. The fawn color can have different tints, such as apricot or silver, and all Pugs have a short, flat, black muzzle.",
    "Belgian Tervuren": "The Belgian Tervuren is a double-coated breed. The topcoat is abundant with long, straight hair that's moderately harsh to the touch, never wiry or silky. The soft, dense undercoat provides protection from the weather and varies in thickness depending on the climate in which the Terv lives. The hair is short on the head, outside the ears, and on the front part of the legs. Tufts of hair protect the opening of the ear. The hair on the rest of the body is long and includes sort of a mini-mane — called a collarette — around the neck, which is most noticeable in males; and a fringe of long hair down the back of the front legs and back of the thighs and on the tail. As in most species, the male is more ornamental than the female.",
    "Norwegian Elkhound": "A Northern breed, the Elkhound has a double coat that sheds dirt and is weather-resistant. The topcoat is short and thick and lies smooth. The undercoat is dense, woolly and soft to the touch.",
    "Finnish Spitz": "Finnish Spitz have a double coat. The undercoat is short, soft, and dense, topped by harsh guard hairs that are one to two inches long. The hair on the head and legs is short. The tail and back of the hind legs has the longest and most dense hair. Males typically have more coat than females, especially at their shoulders.",
    "Irish Terrier": "The Irish Terrier is jacketed with dense, wiry hair. The hairs grow so closely together that even if you part them with your fingers, it's hard to see the skin. It's short enough that you can still see the outline of the body. At the base of the stiff outer coat is some finer and softer hair, lighter in color, which is the undercoat. The double coat protects the Irish Terrier from rough underbrush and cold or wet weather when he's working or playing outdoors.",
    "Shiba Inu": "The Shiba Inu has a thick double coat that gives him a Teddy Bear look. The outer coat is stiff and straight, and the undercoat is soft and thick. He sheds moderately throughout the year and heavily twice a year when he \"blows\" coat (imagine a snowstorm — but on your furniture and clothing).",
    "Kerry Blue Terrier": "The Kerry Blue coat is soft, dense and wavy, and though considered non-shedding, the coat is high maintenance. He needs daily brushing, plus trimming and bathing every four to six weeks.",
    "Manchester Terrier": "Thanks to that short black and tan coat (the only colors seen in this breed), Manchester Terriers are pretty low maintenance. Brush the coat once a week with a rubber or bristle brush to get rid of dead hair and prevent matting. They shed, although not excessively, and regular brushing keeps this under control. They blow their coat twice a year, shedding heavily every spring and fall.",
    "Welsh Springer Spaniel": "Welsh Springer Spaniels have a naturally straight, flat, soft coat that is never wiry or wavy. It's dense enough to serve as protection from wet, cold weather and rough country. They have some moderate feathering on the backs of the forelegs, the hind legs above the hocks, the chest, and the belly. The ears and tail are also lightly feathered.",
    "Doberman Pinscher": "The sleek, smooth Dobie coat is short and lies close to the skin. They may have a slight undercoat around the neck. Their coat colors are black, red, blue, and fawn. They have rust markings above each eye; on their muzzle, throat, and chest; and on their legs and feet.",
    "Dalmatian": "The distinctive Dalmatian coat is lovely to touch, being short, satiny, and fine. The tops of their heads feel almost like velvet. The base color is white with well-defined dense black or deep brown (liver-colored) round spots that vary from dime size to half dollar size evenly distributed over the coat. Expect to see smaller spots on the legs, head, and tail. Spotted ears add the perfect touch. (Where the Dalmatian's spots came from is a mystery. It's thought that they may have been caused by a mutation in the ticking gene.)",
    "Plott": "The Plott Hound has a smooth coat with hair that ranges in texture from fine to medium coarse. The thick double coat provides plenty of protection against wet or cold weather, a necessity for a hunting dog bred in the mountains of North Carolina.",
    "Bouvier des Flandres": "The Bouvier des Flandres is blessed (or cursed, depending on you look at it) with a weather-resistant double coat. The outer coat is coarse and long; the undercoat is fine and dense. It appears in several colors, including fawn, black, salt and pepper, and brindle, and sometimes a white star is found on the chest.",
    "English Springer Spaniel": "English Springer Spaniels have a double coat, which means that they have an insulating undercoat that's covered with a topcoat, in much the same way that you might layer a sweater and a coat for warmth. Their medium-length topcoat is flat or wavy, and the undercoat is short, soft, and dense. Together, they're waterproof, weatherproof, and thornproof. They have a fringe of feathering on the ears, chest, legs and belly. A healthy Springer coat is clean and shiny.",
    "Redbone Coonhound": "The Redbone Coonhound coat is short and smooth. The color should be a rich, deep red, but the breed standard allows for a dark muzzle and a small amount of white on the chest and feet.",
    "Peekapoo": "The Peekapoo's coat is usually soft in texture and has an almost cottony feel. It should be wavy and of medium to long length. There is no undercoat. The desired coat is low-shedding, but a Peekapoo can range from low to average shedding, depending on the roll of the genetic dice.",
    "Borzoi": "The Borzoi's long, silky coat, which can be any color or combination of colors, may be flat, wavy, or curly. Short, smooth hair covers the head, ears, and front of legs, and a profuse, curly frill adorns the neck. Thick feathering covers the tail and rear end. The hair's beautiful silky texture is resistant to dirt and mud, so it's easy to keep clean.",
    "Cockapoo": "The Cockapoo has a single, long coat that can range from straight to loose curls, but it shouldn't be kinky. Cockapoos can be found in all the colors and color combinations that are seen in both Cocker Spaniels and Poodles — a more rich variety of coat colors than is usual in many other breeds.",
    "Kooikerhondje": "The thick, medium-length Kooiker coat is straight or has a slight wave. The color ranges from orange to deep chestnut red on a white background. On the ears are black tips known as earrings. Light feathering adorns the legs, and the predominantly white tail is well feathered.",
    "Black and Tan Coonhound": "A short, dense coat protects the Black and Tan Coonhound as he trails his quarry through rough brush. It is, of course, black, with rich tan markings above the eyes, on the sides of the muzzle, and on the chest, legs, and back of the thighs. The toes bear markings that look as if they were made with a black pencil.",
    "Chesapeake Bay Retriever": "As befits his purpose as a water retriever, the Chessie has a coat that resists water in the same way that a duck's feathers do. The top coat is short, thick, harsh, and oily, and the undercoat is fine, dense, and woolly. Together, they provide super insulation, allowing him to hunt in all conditions, including ice and snow. The oily outercoat and woolly undercoat prevent cold water<p>When your Chessie does something inappropriate such as countersurfing or lifting his leg in the house, you must let him know right then and there — loudly and firmly — that his behavior is unacceptable and not to ever be repeated. No exceptions!</p>from reaching his skin and help him to dry quickly. After he leaves the water and shakes, his coat is merely moist because it doesn't hold water.",
    "Affenpinscher": "Shaggy but neat describes the Affenpinscher's desired appearance. He has a thick, rough coat with a harsh texture, approximately one inch long on the body, shorter on the rump and tail, and longer and shaggier on the head (where it contributes to the monkeylike expression), neck, chest, stomach, and legs. The longer fur around the head and shoulders resembles a cape. Affens don't shed much, but their rough coat must be stripped to maintain its characteristic texture.",
    "Welsh Terrier": "Sporting two coats to waterproof himself, the Welsh Terrier has an outer coat that's hard and wiry and an undercoat that's soft and short. He only has one color pattern: tan and black.",
    "Saint Bernard": "Saint Bernards can be found in two coat types: shorthaired and longhaired. The shorthaired coat is smooth but dense. The hair is slightly bushy on the thighs, and the tail is covered with long, dense hair that becomes shorter toward the tip. The longhaired coat is slightly wavy but never curly or shaggy. The forelegs have a bit of feathering, but the thighs and tail are bushy.",
    "Gordon Setter": "The Gordon Setter's attractive coat is soft and shiny, ranging from straight to slightly wavy. He has long hair on the ears, chest, belly, the back of the legs, and the tail. The tail is short, with feathering that grows in a triangular shape, becoming uniformly shorter toward the end of the tail.",
    "Norfolk Terrier": "The Norfolk Terrier has a double coat that consists of a soft, downy undercoat and a wiry top coat. The coat is weather-resistant, and sheds minimally. The Norfolk coat comes in shades of red, wheaten, black and tan, or grizzle.",
    "Newfoundland": "The Newfoundland has a flat, water-resistant double coat. The outer coat is coarse and long, and the undercoat is soft and dense. Shedding is moderate, and the bulk of it occurs primarily in the spring and fall.",
    "Border Collie": "The Border Collie breed boasts two varieties of coat: rough and smooth. Both are double coats, with a coarser outer coat and soft undercoat. The rough variety is medium length with feathering on the legs, chest, and belly. The smooth variety is short all over, usually coarser in texture than the rough variety, and feathering is minimal.",
    "German Pinscher": "The coat should be shiny and smooth in texture, short and dense with no bald spots. The German Pinscher sports a variety of colors, including various shades of red, stag red (in which there are black hairs intermingled with the red), and Isabella (a light bay or fawn color). German Pinschers can also be black or blue with tan or red markings.",
    "Curly-Coated Retriever": "The Curly-Coated Retriever has a unique coat: a mass of small, crisp curls that lie close to the skin and cover the body from the tail all the way up to the top of the head. It's water- and weather-resistant and protects the skin from any rough brush the dog might run through as he hunts. The curls on the ears might be slightly looser than the curls on the body, and occasionally a Curly has feathering — a longer fringe of hair — on the ears, belly, thighs, feet, and back of the forelegs, but this is usually trimmed. If there is feathering on the tail, people with show dogs remove it, but it certainly doesn't affect a Curly's ability to be a great companion.",
    "American Foxhound": "American Foxhounds have a medium-length coat that lies close to the body and has a hard texture, protecting the hound from brush and briars in the field. The coat comes in many colors; as the saying goes, no good hound is a bad color.",
    "Flat-Coated Retriever": "The Flat-Coated Retriever has a straight, moderately long coat that protects him from all types of weather, water, and ground cover. Feathering on the ears, chest, front, backs of forelegs, underside of the tail, and the thighs is part of the coat's protective function and shouldn't be excessively long. On the neck, especially in males, is a mane of longer, heavier coat. The coat comes in solid black or solid liver, a deep reddish-brown color.",
    "Black Russian Terrier": "Blackies have black coats, but a sprinkling of gray hair can sometimes be seen, even in puppies. They have a double coat, and the outer coat is coarse, with the undercoat soft and thick. It varies in length from 1.5 to 4 inches. Blackies have a tousled coat, although some might be tempted to call it wiry or curly.",
    "Labrador Retriever": "",
    "Pocket Beagle": "The breed standard for Beagles says any hound color is acceptable. Hound colors include all shades and combinations of white or cream, black, tan, lemon, red, brown, liver, blue, and gray.",
    "Appenzeller Sennenhunde": "Appenzellers have a thick, shiny topcoat in black or brown with tan and white markings, covering a thick black, brown, or gray undercoat. The tan markings are symmetrical and appear over the eyes and on the cheeks, chest, and legs. The white markings include a blaze on the face, white from the chin to the chest, white on all four feet, and a white tail tip.",
    "Tibetan Terrier": "The Tibetan Terrier is protected by a double coat: a soft, woolly undercoat and an abundant topcoat with fine hair that can be wavy or straight. The long hair stops just short of the ground, enough that you can see light beneath the dog's body. The hair often falls in a natural part along the spine. The Tibetan Terrier comes in a range of colors and patterns, including white, gold, tricolor, brindle, silver, black, and more.",
    "Basset Hound": "Basset Hounds have smooth, short hair that repels dirt and water. The coat is dense enough to protect them in all sorts of weather. The skin is loose and elastic, giving the Basset his classic droopy hound dog appearance.",
    "Australian Terrier": "The Aussie's shaggy coat is rough to the touch, with a soft undercoat. About two inches in length over most of the body, it is longer on the chest and head. It comes in three color types: blue and tan (tan body with a blue saddle), sandy, and red.",
    "Briard": "Although considered a low- to non-shedding breed, the Briard has an outer coat and undercoat. The outer coat is slightly wavy with a coarse texture, about six inches long, while the undercoat is soft and fine. You'll see it in a variety of colors, or combination of colors, including black and shades of gray and tawny.",
    "Pointer": "An old hunters' saying is that a good Pointer can't be a bad color. The Pointer has a striking coat of liver (dark brown), black, orange, or lemon, with or without a white background. Some Pointers have light or heavy speckles — called ticking — on the white areas of their coat. Tricolor Pointers (white, plus two other colors) exist but aren't very common. Dark-colored Pointers have a black or brown nose; light-colored dogs have a light or flesh-colored nose.",
    "Dachshund": "The Smooth Dachshund's coat is short and shiny. Single-colored Smooth Dachshunds often are red or cream, perhaps with some black hairs. Two-colored Smooth Dachshunds usually are black, chocolate, wild boar (grizzled), gray (blue) or Isabella (fawn) with tan or cream markings. Dappled Dachshunds have a dappled (merle) pattern in their coats, with light and dark colored areas in even distribution (neither the light nor the dark predominates). Whereas dark eyes are required and little or no white hair on the chest is acceptable for solid- and parti-colored Dachshunds, partially or wholly blue eyes and a large amount of white hair on the chest both acceptable for the dappled Dachshunds. Other color patterns are brindle, in which there are dark stripes all over the body, and sable, where there is an overall dark overlay of hair.",
    "Keeshond": "The Keeshond look is fabulous, with his thick, double top coat, woolly undercoat, and a longer outer (or guard) coat. His mane is more profuse in males than in females. His hindquarters have \"trousers,\" longer hair down to the hocks. His tail is like a plume set on a lady's hat.",
    "Finnish Lapphund": "A long, coarse outer coat tops a soft, thick undercoat. The Finnish Lapphund can be found in all colors, including white, black, red, and brown, as well as combinations of colors such as black and tan.",
    "Collie": "The Collie has two coat types: Rough (long hair) and Smooth (short hair). The Rough Collie has an abundant, straight outer coat that is harsh to the touch, and a soft, furry undercoat that is so thick it's difficult to see the skin when you part the hair. The Smooth Collie has a short, dense, flat outer coat with a thick undercoat. Both varieties shed moderately.",
    "Chihuahua": "Chihuahuas come in two different coat types: smooth and long. The smooth-coated Chihuahua has a smooth, shiny coat that fits close to the body with a ruff of thick, longer hair on the neck. The hair on the head and ears is thinner, and the tail is furry.",
    "Sussex Spaniel": "The Sussex Spaniel has an abundant coat that's straight or slightly wavy but not curly. The tail and the legs down to the heel (called the hock) are adorned with moderate fringe of hair known as feathering. The ears are covered with soft, wavy hair, and the neck also has additional hair known as a frill. The coat color is a rich golden liver with no other color, markings or shades of liver.",
    "Stabyhoun": "The Stabyhoun's long, sleek coat comes in black, brown, and orange with white markings. Regular brushing will keep the coat tangle-free and minimize shedding. Unless your Stabyhoun's gotten into something particularly smelly, he doesn't need bathing; baths can ruin the sleekness of the coat.",
    "Icelandic Sheepdog": "The thick double coat of the Icelandic Sheepdog is very waterproof and can be one of two lengths: medium or longer, always with a thick, soft undercoat. It can be straight or slightly wavy, and it comes in several colors — shades of tan, ranging from cream to reddish brown; chocolate brown, gray; and black — all with white markings and sometimes with a black mask. The tail is very bushy. Weekly brushing will keep the coat in good shape.",
    "Bichon Frise": "The Bichon Frise is a double-coated breed, always white. The soft and dense undercoat and course outer coat combine to create a soft but substantial texture. The coat stands away from the body, giving it a powder-puff appearance. The most popular trim for a Bichon follows the lines of the dog's body, leaving the coat long enough to give him the signature \"poufy\" look.",
    "Tibetan Mastiff": "The Tibetan Mastiff has a double coat with a long, thick, coarse-textured topcoat and a heavy, soft, woolly undercoat. The undercoat is thinner during warmer months. The hair is hard and straight, never curly, wavy, or silky.",
    "Bluetick Coonhound": "The smooth, glossy coat is dark blue, thickly mottled with black spots on the back, ears, and sides. The head and ears are mostly black, with tan markings over the eyes and on the cheeks. The Bluetick Coonhound has dark red ticking on the feet, the lower legs below the body line, the chest, and below the tail.",
    "Kuvasz": "The dense white coat of the Kuvasz can grow to six inches in length. Expect to brush your Kuvasz a couple of times a week to prevent mats from forming, using a grooming rake, slicker brush, or pin brush. If your Kuvasz gets matted, use a large-toothed comb and a conditioning spray, along with your fingers, to gently work the mat loose. Kuvaszok shed heavily in the spring and the fall, and need more frequent brushing during these times.",
    "Cairn Terrier": "The scruffy-looking Cairn Terrier has a double coat: a wiry outer coat and soft undercoat. The coat comes in many colors, including red, brindle, black, sand, and gray.",
    "Vizsla": "Dressed in various shades of solid golden rust, the Vizsla has a short, smooth coat that lies close to the body. The eyes and nose come in various shades of brown.",
    "Irish Wolfhound": "The Wolfhound coat is rough and hard. The hair on the eyes and under the jaw is wiry and long. A pet-quality Irish Wolfhound may have a softer or longer coat, but that doesn't affect his ability to be a companion. Coat colors are gray, brindle, red, black, white, or fawn.",
    "Pomeranian": "The Pomeranian's glory is his thick, stand-out, double coat with an undercoat of soft, thick, fluffy hair and a top coat of long, straight, shiny hair that's harsh to the touch. The longer hair around the neck and chest forms a frill, enhancing the Pom's proud appearance.",
    "Toy Fox Terrier": "The coat of a Toy Fox Terrier is short, fine and smooth, slightly longer at the ruff. Generally, the body of a TFT should be mostly white. He comes in several color combinations:",
    "Bulldog": "Your Bulldog's coat should be straight, short, fine textured, smooth and glossy. He has soft, loose skin, especially on the head, neck, and shoulders. His head is covered with heavy wrinkles and he has two loose folds at the throat (from the jaw to the chest) to form what's called a dewlap.",
    "Berger Picard": "The medium-length, weatherproof coat is harsh and crisp to the touch. It comes in a range of fawn and gray shades, including light fawn, dark fawn, gray, gray with black highlights, blue gray, gray red, and brindle.",
    "Italian Greyhound": "An Italian Greyhound's short coat looks glossy like satin and feels soft to the touch. You'll find it in all shades of fawn, cream, red, blue, or black, either solid or with white markings.",
    "Rat Terrier": "A Rat Terrier's coat is short and smooth with dense, shiny fur. You'll see it in several colors and combinations of colors, including white, black with tan or rust, white and black or tan, red, lemon, blue, chocolate and orange. Ticking (intermittent spots) and dark colors are seen too. Generally speaking, all Rats have white markings.",
    "Wirehaired Pointing Griffon": "The Wirehaired Pointing Griffon has a dense double coat. The undercoat is a thick, weather-resistant down. The topcoat is harsh in texture and consists of straight, wiry hair. It is medium in length and should never be curly. The Griffon should have eyebrows and a moustache, both of which are extensions of the undercoat.",
    "Boxer": "Boxers have a sleek, short coat with tight skin over their athletic bodies. They come in two colors: fawn or brindle, with or without white markings. Fawn ranges from light tan to mahogany. Brindle is a striking tiger-striped pattern of black stripes on a fawn background.",
    "Golden Retriever": "Golden Retrievers have a dense, water-repellent outer coat with a thick undercoat. Some coats are wavy, some are straight. The fur feathers on the back of the front legs and underbody, with heavier feathering on the chest, back of the thighs, and tail.",
    "English Foxhound": "English Foxhounds have a shiny, short, dense coat with a hard texture. They usually come in a tricolor pattern of black, white, and tan, but they can also be white with hare (more tan than black and white, giving the look of a hare), badger (a mixture of white, gray, brown, and black hairs), tan, or yellow.",
    "Bracco Italiano": "Bracco Italiano coats be white or white with markings that can be orange, amber, or chestnut. The markings can be larger and prominent or speckled and pale. Grooming is fairly easy because their coats are short and dense. Us a grooming mitt once a week to keep them looking their best.",
    "Petit Basset Griffon Vendeen": "The PBGV's coat is rough, medium long, and harsh to the touch, while his undercoat is thick, soft and short. He has long eyebrows that stick out so they don't obscure the eyes, and the ears are covered with long hair. They also have long hair around their mouths, forming a beard and moustache. Their tails have quite a bit of hair, too. Overall, the PBGV has a casual, tousled appearance.",
    "West Highland White Terrier": "Westies have a double coat, with a short undercoat and a topcoat close to two inches long. That double coat protects him from inclement weather and from the teeth and claws of his quarry. The wee white one should, of course, always be white. Any other color is considered a fault in the show ring.",
    "Catahoula Leopard Dog": "The Catahoula's short to medium-length single coat lies close to the body. Its texture may range from smooth to coarse.",
    "Chow Chow": "Chows can have two coat types, rough and smooth. The rough coat, which is what most people are used to seeing, is thick and abundant, standing off from the body like a parka. Beneath that outer coat lies a soft, thick, woolly undercoat. The hair is thicker around the head and neck, forming a ruff, or mane. The tail, which lies over the back, is also thickly furred.",
    "Bloodhound": "The Bloodhound's coat is loose and thin to the touch. Around the neck and head, it hangs in deep folds. As the head hangs down, the skin falls into loose, pendulous ridges and folds, especially over the forehead and sides of the face. These wrinkles, combined with the loose, pendulous skin beneath the neck and throat (known as the dewlap) and the long, sweeping ears, help funnel scent from the ground up to the Bloodhound's nose and hold it there.",
    "Jack Russell Terrier": "The Parson Russell Terrier comes in two coat types: smooth and broken. Both types have a double coat with a coarse texture. The broken coat is slightly longer with just a hint of eyebrows and a beard. Some Jacks have what's called a rough coat, which is longer than a broken coat. Whatever its type, the coat is never curly or wavy.",
    "German Shepherd Dog": "",
    "Cavalier King Charles Spaniel": "Cavaliers are adorned with medium-length coats that are silky to the touch and may be slightly wavy. Adult Cavaliers have feathering on their ears, chest, legs, feet and tail.",
    "Maltese Shih Tzu": "The coat of the Maltese Shih Tzu should be long, and soft and silky in texture. It should have some wave to it, but it should never be curly. Maltese Shih Tzus generally are white or white with tan markings on the body and ears, but they can sport a combination of other colors, such as black, brown, black and white, brown and white, and black and brown.",
    "Goldador": "A Goldador should have the same double coat as a Labrador Retriever, with a short, thick, straight topcoat and a soft, dense undercoat (some have a slight wave down the back). Generally, a Goldador's coat color ranges from yellow to gold to reddish gold, but because the Goldador is a crossbreed, he may inherit the black coat of a Lab parent.",
    "Pembroke Welsh Corgi": "Pembrokes are double-coated, with a thick undercoat and a longer topcoat. They shed continuously, with heavier shedding at least twice a year. You'll find them in red, sable, black, tri-colored, or fawn, usually with white markings.",
    "Polish Lowland Sheepdog": "The shaggy PON has a long, dense topcoat and a soft, thick undercoat. The coat comes in many colors; the most common are white with black, gray, or sandy patches; or gray with white or chocolate.",
    "Chinook": "The double-coated Chinook has medium length hair with a thick, soft undercoat and a coarse outer coat. Chinooks who live in warm climates tend to have coats that are less dense than those of Chinooks in colder environments.",
    "Harrier": "Harriers have short, thick, shiny coats, and very soft ears. They can come in a wide variety of colors, but the most common colors seen in the U.S. are tri-colors (black, tan and white), and red and white. They resemble an English Foxhound, only smaller.",
    "Miniature Pinscher": "The Min Pin is extremely handsome in his short, sleek coat. Colors include red, black and rust, and chocolate and rust.",
    "American Eskimo Dog": "The white, fluffy American Eskimo Dog has a double coat with a dense undercoat and a longer outer coat. The hair is straight with no curl or wave. He has a pronounced ruff around the neck. His front and rear legs are well feathered, and the fur on his tail is profuse. He is most often pure white, or white and cream.",
    "Giant Schnauzer": "The Giant Schnauzer's outer coat is wiry, hard, and dense, with hairs that stand up from the skin. Beneath it is a soft undercoat. On the face are a harsh beard and eyebrows, the Schnauzer hallmark.",
    "Small Munsterlander Pointer": "The Small Munsterlander Pointer sports a brown-and-white coat with moderate feathering on the tail, belly, back of the forelegs, and inside the thighs.",
    "German Shorthaired Pointer": "The GSP has a short, thick, water-repellent coat that's slightly longer on the underside of the tail and the back edges of the rear end, known as the haunches. On the head, the hair is softer, thinner, and shorter.",
    "Puggle": "The Puggle has a short, smooth, double coat. The undercoat is short and dense, covered by a slightly longer topcoat. Colors include fawn, red, tan, lemon, black, or any of those colors with white (known as particolor). Some Puggles have black masks on the face.",
    "Akita": "There are many different colors and color combinations in the American Akita, including black, white, chocolate, a combination of color and white, or brindle. The Akita is double-coated, with the undercoat being very dense and plush; the topcoat is short.",
    "Afghan Hound": "Properly groomed, the Afghan coat is spectacular. It is very fine in texture, similar to human hair, and thick and silky. On the head is a long, silky topknot. With the exception of the back, the entire body is abundantly covered in hair, even the ears and feet. The hair is short and close along the back and smooth in mature dogs.",
    "Rhodesian Ridgeback": "The Ridgeback coat is short and shiny and tends to be odor-free. Ridgebacks who live indoors shed a little year-round, while those who live outdoors have heavier seasonal shedding.",
    "Lhasa Apso": "The Lhasa coat is gorgeous. Normally it is long, straight, and dense. It comes in many colors, including honey, black, white, slate, or parti-color.",
    "Tibetan Spaniel": "The Tibetan Spaniel has a silky double coat that's smooth on the face and the front of the legs and moderately long on the rest of the body. The ears, tail, and backs of the forelegs and buttocks have longer hair, and a mane of long hair (sometimes referred to as a shawl) surrounds the neck. The Tibbie's coat can be any color or mixture of colors.",
    "Field Spaniel": "The Field Spaniel has a dense, water-repellent single coat, meaning there's no undercoat. His hair is moderately long and can be flat or slightly wavy. The chest, underbody, backs of the legs, and rear end are adorned with moderate feathering but not the masses of fur you might see on a Cocker Spaniel.",
    "Dogue de Bordeaux": "The Dogue de Bordeaux's coat is fine, short, and soft. The color ranges from a rich shade of light fawn to dark red fawn and covers thick, loose skin.",
    "Bullmastiff": "The Bullmastiff coat is short and dense, offering good protection from rain, snow, and cold.",
    "Papillon": "The Papillon's long, flowing coat is straight, fine, and silky, with no undercoat. Cascading down his chest is a frill of hair. His beautiful butterfly-like ears are fringed with hair, and the insides are covered with medium-length silken hair. Feathering covers the backs of the forelegs, and the hind legs are dressed in breeches, a fringe of longish hair on the thigh area, also known as culottes. Topping it all off is a long, flowing plume of a tail carried proudly arched over the body.",
    "Belgian Sheepdog": "The Belgian Sheepdog is a double-coated breed. The topcoat is abundant with long, straight hair that's moderately harsh to the touch, never wiry or silky. The soft, dense undercoat provides protection from the weather and varies in thickness depending on the climate in which the Belgian Sheepdog lives.",
    "Portuguese Water Dog": "The Portuguese Water Dog has two coat types: curly and wavy. Both types are a single coat, meaning there's no undercoat. That's why the Portie doesn't shed as much as some breeds and why he's often considered to be hypoallergenic. (Although all dogs shed hair and dander to some degree — there's no such thing as a truly hypoallergenic dog.)",
    "Australian Shepherd": "",
    "Japanese Chin": "The Japanese Chin has an abundant coat that's silky to the touch. It's moderately long with a thick mane, feathered ears, a plumed tail, feathering on the back of the front legs, and light feathering that resembles culottes on the rear legs. The head, face, and forelegs are covered with short hair. Japanese Chin can have coats that are black and white, red and white, or black and white with tan points.",
    "Beagle": "The breed standard for Beagles says \"any hound color\" is acceptable. The most common color for Beagles is tricolor with a black saddle (the area across the back), white legs, chest, belly, and a white tip on the tail, and tan on the head and around the saddle.",
    "Irish Red and White Setter": "The long, silky coat is white with deep patches of red. The backs of the legs, the outer ear flap, the chest and throat, and the tail are adorned with straight, flat feathering.",
    "Chinese Shar-Pei": "A quintessential Shar-Pei characteristic second only to his wrinkles is his bristly coat. It stands straight up, like a 1950s butch-style hairdo, and varies in length, from a really short \"horse\" coat to a longer \"brush\" coat. You can find it in many colors, including solid black, cream, fawn, red, sable, and blue. He sheds minimally.",
    "American Water Spaniel": "This is what's known as a double-coated dog. A dense undercoat protects the American Water Spaniel against weather, water, and scratchy underbrush. The outer coat may have uniform waves — called a marcel coat — or tight curls. The amount of curl or wave can vary from one area of the dog's body to another. The forehead is covered with short, smooth hair, and moderate feathering adorns the tail and legs.",
    "Coton de Tulear": "The Coton's coat is one of his distinguishing features. It's long, soft, and thick, with what can only be described as a fluffy, cottony texture. By adulthood, it's usually four inches long.",
    "Ibizan Hound": "The Ibizan Hound can have a coat that's shorthaired or wirehaired. The wirehaired coat can be one to three inches long, with the longest hair on the back, the back of the thighs, and the tail. He may sport a moustache on his muzzle. Whether he has a short or wire coat, the Beezer's hair is hard to the touch.",
    "German Wirehaired Pointer": "The German Wirehaired Pointer has a functional double coat that protects him from wet and cold conditions as well as rough or heavy underbrush. The coarse, wiry coat is one to two inches long. The hair is straight and harsh and lies flat.",
    "Alaskan Malamute": "The Alaskan Malamute sports a dense double coat. The thick, coarse outer coat, known as the guard coat, should not be soft or long. The undercoat is one to two inches deep. It's oily and woolly to repel wetness and cold.",
    "Glen of Imaal Terrier": "The Glen coat is medium length, with a harsh-textured topcoat and shorter undercoat. The coat comes in several shades of wheaten, from cream to red; any shade of blue, from silver to slate; and brindle, a tiger stripe-like pattern that mixes one dominant color with darker streaks or patches. The Glen is considered to be a non- to low-shedding breed.",
    "Sealyham Terrier": "Sealyham Terriers have weather-resistant, medium-long double coats. The undercoat is dense and soft, while the top coat is hard and wiry. The hair around the face and muzzle is very long, compared to the rest of the coat. Sealies are all white, although some have lemon, tan, or badger markings on the head and ears.",
    "Scottish Terrier": "While many people think of them as black, Scottish Terriers can also be grey or steel, brindle, or wheaten. The wheaten ones look a bit like West Highland White Terriers, which isn't surprising given their intertwined history.",
    "French Bulldog": "",
    "Irish Water Spaniel": "The Irish Water Spaniel has a double coat — a top coat and an under coat — with tight, crisp ringlets that cover the back, back, sides, and rear. Beneath the ribs the hair is longer, and curls and waves of hair cover the legs. Hair on the throat is short and smooth, forming a v-shaped patch. The curly body forms a sharp contrast with the smooth coat on the face, throat, toes, and tail. Speaking of the tail, it's a striking characteristic of the breed. Wide at the root, where the tail meets the body, it tapers to a fine point. It's covered with short, smooth hair and is known as a rat tail.",
    "Schnoodle": "Schnoodles are low-shedding dogs and must be clipped or trimmed. The Schnoodle coat is meant to resemble a Schnauzer puppy's: soft and wavy. Generally, first-generation litters have a wavy coat that's soft in texture and remains soft throughout the dog's life.",
    "Komondor": "The Komondor has a wonderfully unique coat. During puppyhood, they have soft curls that grow heavy as they mature, developing into long, feltlike cords that resemble the strands of a mop. The undercoat is soft and woolly, the topcoat coarse. Puppies have a cream or buff shading to their coats, but this color fades to white as they grow up.",
    "Whippet": "The Whippet's short, smooth coat lies close to the body. It can be any color or color combination. You'll see him in black, white, red, fawn, blue, cream, brindle, and various combinations of those colors with a wide variety of spots, blazes, and patches.",
    "Border Terrier": "The Border Terrier has a short, dense undercoat covered with a wiry topcoat. His skin is thick and loose — something that came in handy during his fox-hunting days, as it protects him from bites.",
    "Maltese": "The stunning Maltese coat is pure white, silky, and straight, reaching all the way to the ground. Maltese don't have the undercoat typical to many breeds and don't shed much.On the down side, Maltese coats mat easily and become dirty. In addition, Maltese are prone to unsightly tear stains on their faces.",
    "Bearded Collie": "To protect him from Scottish weather extremes, the Beardie has a flat, harsh, strong and shaggy outer coat and a soft, furry undercoat. The coat falls naturally to either side without need of a part. Long hair on the cheeks, lower lips, and under the chin forms the beard for which he is known.",
    "Silky Terrier": "This breed's coat is beautiful: long and sleek, parted down the back, and hanging five to six inches down. The color is a rich tan and various shades of blue.",
    "Mastiff": "The Mastiff has a short, straight outer coat with a dense, shorter undercoat. The coat comes in fawn, apricot, or brindle. Brindle Mastiffs have a fawn or apricot background color with dark stripes. The muzzle, nose, ears, and eye rims are dark, the blacker the better. They may have a small patch of white on the chest.",
    "Bull Terrier": "The Bull Terrier's coat is short, flat, and shiny, with a hard texture. Bull Terriers come in two color varieties: white and colored. White Bull Terriers are solid white, with or without colored markings on the head but nowhere else on the body. Colored Bull Terriers are any color other than white or any color with white markings.",
    "Yorkshire Terrier": "The Yorkshire Terrier's coat is long, silky, and perfectly straight without any hint of a wave. Show dogs have hair that reaches the floor. They have a single coat and shed very little.",
    "Chinese Crested": "Powderpuff coats are seen in all colors and in combinations of mahogany, blue, lavender, or copper. They can be solid or spotted. The skin tones of the Hairless are pink and black. Perhaps it's the Hairless's essential nakedness that made stripper Gypsy Rose Lee a breeder.",
    "Yorkipoo": "The coat of the Yorkipoo can range from straight to curly, and it should be luxuriously soft and silky in texture — running your fingers through it is heavenly.",
    "Great Dane": "The six usual colors of Great Danes' smooth, short coats are:",
    "Cardigan Welsh Corgi": "Cardis are double-coated, with a short undercoat and a longer, thick topcoat. They shed continuously, with periods of heavier shedding at least twice a year. Be prepared to brush a Cardigan frequently to keep flying hair under control. Daily brushing and warm baths to remove excess coat may be necessary during shedding season.",
    "Sloughi": "The Sloughi's coat is short, dense, and fine. Hair ranges in color from light sand through red sand (fawn), with or without a black mask; with or without a black mantle; with or without black brindling; and with or without a black overlay.",
    "Bedlington Terrier": "The Bedlington's distinctive coat is an unusual combination of harsh and soft hair. It feels crisp but not wiry and has a tendency to curl, especially on the head and face. It doesn't shed much. The coat of a Bedlington trimmed for the show ring is no longer than one inch on the body, with the hair on the legs slightly longer.",
    "Maltipoo": "The Maltipoo has a low-shedding, low-dander coat with a fluffy, soft, wool-like texture. It's medium to long in length, and ranges from slightly wavy to curly. The coat comes in a variety of colors, with the more common colors being cream, white, and silver.",
    "Bernese Mountain Dog": "The Berner coat is gorgeous: a thick double coat with a longer outer coat and a wooly undercoat. Characteristically tricolored, the majority of the Berner's body is covered with jet-black hair with rich rust and bright white. There's usually a white marking on the chest that looks like an inverted cross, a white blaze between the eyes, and white on the tip of the tail.",
    "Treeing Walker Coonhound": "The smooth and shiny tricolor coat can be white with black spots and tan markings, or black with white markings and tan trim, known as saddleback or blanketback.",
    "Old English Sheepdog": "If you want a dog with big hair, the Old English Sheepdog is the one for you. This breed has hair galore: a profuse, shaggy coat that is neither straight nor curly. The breed has a double coat, with a textured outer coat and soft undercoat. Colors include gray, grizzle, blue or blue merle, brown, and fawn, usually mixed with white markings."
}